# Ultralytics YOLO11s with P2 Small-Object Detection Head (Targeting mAP > 85%)
nc: 2  # number of classes (fire, smoke)
scales:
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2  (320x320)
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4  (160x160)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  (160x160) - 保留浅层高分辨率空间特征
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8  (80x80)
  - [-1, 2, C3k2, [256, True, 0.25]]  # 4  (80x80)
  - [-1, 1, Conv, [256, 3, 2]]   # 5-P4/16 (40x40)
  - [-1, 2, C3k2, [512, True, 0.5]]   # 6  (40x40)
  - [-1, 1, Conv, [512, 3, 2]]   # 7-P5/32 (20x20)
  - [-1, 2, C3k2, [512, True, 0.5]]   # 8  (20x20)
  - [-1, 1, SPPF, [512, 5]]      # 9  (20x20)
  - [-1, 2, C2PSA, [512]]        # 10 (20x20)

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11 (40x40)
  - [[-1, 6], 1, Concat, [1]]                   # 12 融合 P4 (40x40)
  - [-1, 2, C3k2, [512, False]]                 # 13 (40x40)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14 (80x80)
  - [[-1, 4], 1, Concat, [1]]                   # 15 融合 P3 (80x80)
  - [-1, 2, C3k2, [256, False]]                 # 16 (80x80)

  # ==== 新增：向浅层上采样构建 P2 检测分支 ====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17 (160x160)
  - [[-1, 2], 1, Concat, [1]]                   # 18 融合极其丰富的浅层 P2 特征 (160x160)
  - [-1, 2, C3k2, [128, False]]                 # 19 (160x160) -> 【检测头 1: 超小目标/远景浓烟】

  # ==== 下采样回传融合 ====
  - [-1, 1, Conv, [128, 3, 2]]                  # 20 (80x80)
  - [[-1, 16], 1, Concat, [1]]                  # 21 融合 80x80 分支
  - [-1, 2, C3k2, [256, False]]                 # 22 (80x80)  -> 【检测头 2: 中下目标】

  - [-1, 1, Conv, [256, 3, 2]]                  # 23 (40x40)
  - [[-1, 13], 1, Concat, [1]]                  # 24 融合 40x40 分支
  - [-1, 2, C3k2, [512, False]]                 # 25 (40x40)  -> 【检测头 3: 中大目标】

  - [-1, 1, Conv, [512, 3, 2]]                  # 26 (20x20)
  - [[-1, 10], 1, Concat, [1]]                  # 27 融合 20x20 分支
  - [-1, 2, C3k2, [512, True]]                  # 28 (20x20)  -> 【检测头 4: 全景巨型火焰】

  - [[19, 22, 25, 28], 1, Detect, [nc]]         # 4头输出，全面覆盖远近火灾和微小烟气